//index.js

import express from "express";
import * as colors from "colors";
import {
  useMultiFileAuthState,
  makeWASocket,
  DisconnectReason,
  downloadContentFromMessage,
  generateWAMessage,
} from "@whiskeysockets/baileys";
import { connectToMongoDB } from "./db/connectToMongoDB.js";
import dotenv from 'dotenv';
dotenv.config()
import cors from "cors";
import { app, io, server } from "./socketio/socket.js";
import path from "path";
const __dirname = path.resolve();
const PORT = process.env.PORT || 8080;
import cfonts from "cfonts";
import { downloadMediaMessage } from '@whiskeysockets/baileys'
app.use(express.json());
app.use(cors());
import pino from "pino";
import https from 'https'
// Define the static middleware after defining the catch-all route
// Define the static middleware before defining the catch-all route
app.use(express.static(path.join(__dirname, "/frontend/dist")));

// Define the catch-all route after the static middleware
app.get("/app", (req, res) => {
  res.sendFile(path.join(__dirname, "frontend", "dist", "index.html"));
});

import Message from "./models/message-model.js";
import Profile from "./models/profile-info-model.js";

await server.listen(PORT, () => {
  connectToMongoDB();
  console.log(
    "Server Is Running On ",
    `http://localhost:${PORT}`.blue.underline.bold
  );
});

// Function to connect to WhatsApp
async function connectToWhatsApp() {
  const { state, saveCreds } = await useMultiFileAuthState("SRIJI-SESSIONS");
  const sock = makeWASocket({
    auth: state,
    printQRInTerminal: true,
    // logger: pino({ level: 'debug' }),
  });

  sock.ev.on("connection.update", async (update) => {
    const { qr, connection, lastDisconnect } = update || {};

    if (qr) {
      console.log("QR Code Generated...");
      console.log(qr);
      // io.emit("whatsapp.qr", qr);
    }

    if (connection === "close") {
      const shouldReconnect =
        lastDisconnect?.error?.output?.statusCode !==
        DisconnectReason.loggedOut;
      if (shouldReconnect) {
        connectToWhatsApp();
      } else {
        console.log("Connection Closed, You're Now Logged Out");
      }
    }
  });

  sock.ev.on("creds.update", saveCreds);

  // Listener for 'messages.upsert': { messages: WAMessage[], type: MessageUpsertType }
  sock.ev.on("messages.upsert", ({ messages }) => {
    const m = {
      name: messages[0]?.pushName?.replace(/\n/g, "")?.trim() || "",
      chat: messages[0]?.key?.remoteJid || "",
      sender: messages[0]?.key?.remoteJid?.endsWith("@s.whatsapp.net")
        ? messages[0]?.key?.remoteJid
        : messages[0]?.key?.participant,
      isGroup: messages[0]?.key?.remoteJid?.endsWith("@g.us") ? true : false,
      isDm: messages[0]?.key?.remoteJid?.endsWith("@s.whatsapp.net")
        ? true
        : false,
      text:
        messages[0]?.message?.conversation ||
        messages[0]?.message?.extendedTextMessage?.text ||
        messages[0]?.message?.imageMessage?.caption ||
        messages[0]?.message?.videoMessage?.caption ||
        messages[0]?.message?.viewOnceMessage?.caption ||
        messages[0]?.message?.viewOnceMessageV2?.caption,
      key: messages[0]?.key?.id || "",
      fromMe: messages[0]?.key?.fromMe,
      definedType:
        messages[0]?.message?.conversation ||
          messages[0]?.message?.extendedTextMessage?.text
          ? "textMessage"
          : messages[0]?.message?.stickerMessage
            ? "stickerMessage"
            : messages[0]?.message?.imageMessage
              ? "imageMessage"
              : messages[0]?.message?.videoMessage
                ? "videoMessage"
                : messages[0]?.message?.audioMessage
                  ? "audioMessage"
                  : messages[0]?.message?.editedMessage
                    ? "editedMessage"
                    : messages[0]?.message?.viewOnceMessage
                      ? "viewOnceMessage"
                      : messages[0]?.message?.viewOnceMessageV2
                        ? "viewOnceMessageV2"
                        : messages[0]?.message?.viewOnceMessageV2Extension
                          ? "viewOnceMessageV2Extension"
                          : undefined,
      voType: '',
      base64: '',
      quoted: {
        log:
          messages[0].message?.extendedTextMessage?.contextInfo ||
          messages[0].message?.extendedTextMessage?.contextInfo,
        text:
          messages[0].message?.extendedTextMessage?.contextInfo?.quotedMessage
            ?.conversation ||
          messages[0].message?.extendedTextMessage?.contextInfo?.text ||
          "",
        sender:
          messages[0].message?.extendedTextMessage?.contextInfo?.participant ||
          "",
        tagged:
          messages[0].message?.extendedTextMessage?.contextInfo?.mentionedJid ||
          "",
      },
      replyingTo: messages[0]?.key?.remoteJid?.endsWith("@s.whatsapp.net")
        ? messages[0]?.message?.extendedTextMessage?.contextInfo?.quotedMessage
          ?.conversation ||
        messages[0].message?.extendedTextMessage?.contextInfo?.text ||
        global?.db?.data?.users[messages[0]?.key?.remoteJid]?.lastReply ||
        ""
        : messages[0]?.message?.extendedTextMessage?.contextInfo?.quotedMessage
          ?.conversation ||
        messages[0].message?.extendedTextMessage?.contextInfo?.text ||
        false,
      itself: messages[0],
    };

    createNewProfile(m.chat, m.isDm ? 'DM' : m.isGroup ? 'GP' : undefined, m.fromMe ? undefined : m.name)
    // console.log(m);
    handleMessage(m);
  });

  async function createNewProfile(id, type, name) {
    if (!type) return;

    try {
      // Assuming Profile is a Mongoose model
      const user = await Profile.findOne({ id: id });
      if (user) return; // If user already exists, return

      // Fetch additional information
      const about = await sock.fetchStatus(id).status;
      let ppUrl;
      try { ppUrl = await sock.profilePictureUrl(id, 'image'); } catch (e) { ppUrl = undefined }
      // console.log(ppUrl)
      if (!ppUrl) return
      const imageData = await downloadImage(ppUrl) || undefined;

      // Convert image data to base64
      const base64Image = Buffer.from(imageData).toString('base64');

      // Create new profile object
      const newProfile = new Profile({
        name,
        id,
        about,
        dps: [base64Image], // Assuming dps is an array of base64 images
        type
      });

      // Save the new profile to the database
      await newProfile.save();

      // console.log('New profile created:', newProfile);
    } catch (error) {
      // console.error('Error handling user Profile:', error);
      console.log("Error handling user Profile ... Contact Developer If it repeats".red.bold);
    }
  }
  const extractURLsFromString = (text) => {
    const urlRegex = /(https?:\/\/[^\s]+)/g;
    const urls = text.match(urlRegex);
    return urls || [];
  };
  app.post("/sendMessage", async (req, res) => {
    try {
      //TODO: add debugger for this ->> using if the number exists function in baileys
      const m = {
        chat: req.body.chat || process.env.MODS,
        text: req.body.payload.text || "",
        tags: req.body.payload.tags || [],
        type: req.body.payload.radioOption || "NormalMessage",
        mentions: undefined
      }
      try {
        if (m.tags.includes("#rm")) {
          const readmore = `‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎`
          m.text = m.text.replace(/#rm/g, readmore)
        }
        if (m.tags.includes("@eo")) {
          if (!(m?.chat?.endsWith("@g.us"))) return
          const participants = await (await sock.groupMetadata("120363168282353688@g.us")).participants;
          const participantIds = participants.map(participant => participant.id);
          m.text = m.text.replace(/@eo/g, `\n\n> @${participantIds.map(id => id.split('@')[0]).join('\n> @')}\n\n`);
          m.mentions = participantIds.map(id => `${id}`);
          // console.log(await participants)
        }
        if (m.tags.includes("@ta")) {
          if (!(m?.chat?.endsWith("@g.us"))) return;
          const participants = await (await sock.groupMetadata("120363168282353688@g.us")).participants;
          const adminIds = participants.filter(participant => participant.admin === 'admin').map(admin => admin.id);
          m.text = m.text.replace(/@ta/g, `\n\n> @${adminIds.map(id => id.split('@')[0]).join('\n> @')}\n\n`);
          m.mentions = adminIds.map(id => `${id}`);
          // console.log(await participants)
        }
        if (m.tags.includes("#mt")) {
          // Extract participant IDs from the message text using regex
          const regex = /(?:\b\d{12}\b)|(?:\@\d+\b)/g; // Regex to match phone numbers or @mentions
          const matches = m.text.match(regex);
          const participantIds = matches ? matches.map(match => match.replace('@', '')) : [];

          // Filter out unique participant IDs
          const uniqueParticipantIds = [...new Set(participantIds)];

          // Replace matches directly with mention strings in the message text
          m.text = m.text.replace(regex, match => {
            if (match.startsWith('@')) {
              const userId = match.substring(1); // Remove @
              if (uniqueParticipantIds.includes(userId)) {
                return `@${userId}`; // Replace @mention with participant's id
              } else {
                return match; // Keep original @mention if not found in participants
              }
            } else {
              return match; // Keep phone number as is
            }
          });

          // Update mentions array
          m.mentions = uniqueParticipantIds.map(id => `${id}@s.whatsapp.net`);
        }

      } catch (e) {
        console.log(e)
      } finally {
        switch (m.type) {
          case 'NormalMessage':
            sock.sendMessage(m.chat || process.env?.MODS, { text: m.text.substring(0, 65535), mentions: m.mentions || undefined });
            break;
          case 'LoadingMessage':
            const readmore = `‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎`

            sock.sendMessage(m.chat, { text: `> Loading Your Message... This may take a while ${readmore} |${m.text}`, mentions: m.mentions || undefined });
            break;
        }
        res.status(200).json({ reciever: chat, text: m.text });
      }
      // res.status(200).json({ data: "everything ok" });
    } catch (error) {
      res.status(500).json({ data: "Something Went Wrong 974" });
    }
  });

  app.post("/getMessages", async (req, res) => {
    try {
      const requestedChat = req.body.chat;
      if (!requestedChat) {
        return res.status(400).json({ error: "chat parameter is missing" });
      }

      const mess = await Message.find({ chat: requestedChat })
        .sort({ updatedAt: -1 }) // Sort in descending order by updatedAt
        .limit(20); // Limit to the last 20 messages

      if (!mess || mess.length === 0) {
        return res.status(200).json({});
      }

      // Reverse the order of messages
      const reversedMessages = mess.reverse();

      res.status(200).json({ message: reversedMessages });
    } catch (error) {
      console.error("Error occurred:", error);
      res.status(500).json({ error: "Something Went Wrong" });
    }
  });



  app.get("/getUsers", async (req, res) => {
    try {
      const distinctUsers = await Message.aggregate([
        // Sort by the most recently modified message
        { $sort: { updatedAt: -1 } },

        // Group by chat
        {
          $group: {
            _id: "$chat",
            name: { $first: "$name" },
            chat: { $first: "$chat" },
            isGroup: { $first: "$isGroup" },
            updatedAt: { $first: "$updatedAt" },
          },
        },
        {
          $project: {
            _id: 0,
            name: 1,
            chat: 1,
            isGroup: 1,
            updatedAt: 1,
          },
        },
      ]);
      res.status(200).json({ distinctUsers });
    } catch (error) {
      console.error("Error occurred:", error);
      res.status(500).json({ error: "Something Went Wrong" });
    }
  });

  async function handleMessage(m) {
    // console.log(m)
    if (m.definedType === undefined) return logUndefined(m)
    logDefined(m)
    switch (m.definedType) {
      case 'textMessage':
        // console.log(m.itself)
        await saveMessage(m);
        if (m.text.startsWith("> Loading Your Message... This may take a while")) {
          try {
            const [, texxx] = m.text.split('|');
            let keyy = m.itself.key;
            const jid = m.chat;
    
            const delay = (ms) => new Promise(resolve => setTimeout(resolve, ms));
    
            const sendMessageWithDelay = async (message, delayTime) => {
              await delay(delayTime);
              await sock.sendMessage(jid, {
                text: message,
                edit: keyy,
              });
            };
            const loadingMessage = ' Loading Message...⏳*';
            const messageDelay = 50;
    
            let [a, b, c, d, e, f, g, h] = `> *⢎⡰,> *⢎⡡,> *⢎⡑,> *⢎⠱,> *⠎⡱,> *⢊⡱,> *⢌⡱,> *⢆⡱`.split(',').map(val => val + loadingMessage);
    
            for (let i = 0; i < 4; i++) {
              await sendMessageWithDelay(a, messageDelay);
              await sendMessageWithDelay(b, messageDelay);
              await sendMessageWithDelay(c, messageDelay);
              await sendMessageWithDelay(d, messageDelay);
              await sendMessageWithDelay(e, messageDelay);
              await sendMessageWithDelay(f, messageDelay);
              await sendMessageWithDelay(g, messageDelay);
              await sendMessageWithDelay(h, messageDelay);
            }
            await sendMessageWithDelay(texxx, messageDelay); // Moved to finally block
          } catch (e) {
            console.log(e);
          }
        }
        break;
      case 'imageMessage':
      case 'videoMessage':
      case 'audioMessage':
        await saveImageMessage(m);
        break;
      case 'viewOnceMessageV2':
      case 'viewOnceMessage':
      case 'viewOnceMessageV2Extension':
        handleVO(m);
        // let msg = m.itself.message.viewOnceMessageV2.message
        // console.log(msg)  
        break; // Added break statement
    }
    

  }

  const handleVO = async (m) => {
    const viewOnce = await generateWAMessage(m.chat, {
      forward: {
        key: {
          id: m.key.id,
          remoteJid: m.chat
        },
        message: m?.itself?.message?.viewOnceMessageV2?.message || m?.itself?.message?.viewOnceMessageV2Extension?.message || {}
      }
    }, {})
    // m.voType = (viewOnce?.message?.imageMessage?.mimetype?.startsWith('image/') === true) ? 'imageMessage' :
    //        (viewOnce?.message?.videoMessage?.mimetype?.startsWith('video/') === true) ? 'videoMessage' :
    //        (viewOnce?.message?.audioMessage?.mimetype?.startsWith('audio/') === true) ? 'audioMessage' :
    //        'unknownMessage';
    m.voType = viewOnce?.message?.imageMessage?.mimetype || viewOnce?.message?.videoMessage?.mimetype || viewOnce?.message?.audioMessage?.mimetype;

    // console.log(m.voType);

    const buffer = await downloadMediaMessage(
      viewOnce,
      'buffer',
      {},
      {
        reuploadRequest: sock.updateMediaMessage,
        logger: ''
      }
    )

    const base64Image = await Buffer.from(await buffer).toString('base64');
    // console.log(base64Image)
    m.base64 = await base64Image;
    m.definedType = 'viewOnceMessage'
    await saveMessage(m)
  }
  const saveImageMessage = async (m) => {
    const buffer = await downloadMediaMessage(
      m.itself,
      'buffer',
      {},
      {
        reuploadRequest: sock.updateMediaMessage
      }
    )
    const base64Image = await Buffer.from(await buffer).toString('base64');
    // console.log(base64Image)
    m.base64 = await base64Image;
    await saveMessage(m)
  }
  const saveMessage = async (messageData) => {
    try {
      const message = new Message(messageData);
      await message.save();
      console.log("Message saved successfully :)".blue.italic.bold);
    } catch (error) {
      console.log("Error saving message to database:", error);
    } finally {
      io.emit("recievedMessage", messageData);
    }
  };
  const logUndefined = async (m) => {
    return console.log(
      "UNDEFINED Message Type Found... LOGGING MESSAGE OBJ :\n".underline.red,
      JSON.stringify(m.itself, null, 2).italic.yellow
    );
  }
  const logDefined = async (m) => {
    const separator =
      "--------------------------------------------------------";
    const arrow = "➜";
    const replyEmoji = "💬";
    const senderEmoji = "👤";
    const groupEmoji = "👥";

    // Log a text message with enhanced design
    console.log(separator);
    console.log(
      `📩 A text message received from ${senderEmoji} ${m.sender?.green} in chat ${m.chat?.green} 📩\n`
        .bold
    );
    console.log("Name:".magenta, m.name?.red.bold);
    console.log("Chat:".magenta, m.chat?.yellow);
    console.log("Sender:".magenta, `${senderEmoji} ${m.sender?.yellow.italic}`);
    console.log(
      "Is Group:".magenta,
      `${m.isGroup ? `${groupEmoji} Yes` : "No"}`.yellow
    );
    console.log("Is DM:".magenta, `${m.isDm ? "Yes" : "No"}`.yellow);
    console.log("Message Type:".magenta, m.definedType?.yellow);
    console.log("Text:".magenta, m.text?.cyan.bold || "undefined".red);
    console.log("Key:".magenta, m.key?.yellow);
    console.log("From Me:".magenta, `${m.fromMe ? "Yes" : "No"}`.yellow);
    console.log("Quoted :".magenta, m.quoted ? "true".green : "false".red);
    console.log(
      m.quoted
        ? `Quoted Sender: ${senderEmoji} ${m.quoted.sender}`.magenta.yellow
        : ""
    );

    console.log("Tagged:".magenta, m.quoted?.tagged);

    // Design for Replying To section
    if (m.replyingTo) {
      console.log(`\t╰┈➤ ${replyEmoji} Replying To:`.bgYellow.black);
      console.log(`\t${arrow} ❝ ${m.replyingTo?.cyan}❞`);
    }
    console.log(separator);

  }
  const randomFont = [
    "block",
    "slick",
    "grid",
    "pallet",
  ];

  // Randomly select a font style and gradient colors
  setTimeout(() => {
    const firstIndex = Math.floor(Math.random() * randomFont.length);
    const selectedFont1 = randomFont[firstIndex];

    // Remove the selected font from the array
    const remainingFonts = randomFont.slice(0, firstIndex).concat(randomFont.slice(firstIndex + 1));

    const secondIndex = Math.floor(Math.random() * remainingFonts.length);
    const selectedFont2 = remainingFonts[secondIndex];

    cfonts.say("Welcome To|Casper Reloaded!", {
      font: selectedFont1,
      align: "center",
      colors: ["white"],
      background: "transparent",
      letterSpacing: 1,
      lineHeight: 1,
      space: true,
      maxLength: "0",
      gradient: ["red", "magenta"],
      independentGradient: false,
      transitionGradient: false,
      env: "node",
    });

    setTimeout(() => {
      cfonts.say("Created By|Dev-SRIJI!", {
        font: selectedFont2,
        align: "center",
        colors: ["white"],
        background: "transparent",
        letterSpacing: 1,
        lineHeight: 1,
        space: true,
        maxLength: "0",
        gradient: ["red", "magenta"],
        independentGradient: false,
        transitionGradient: false,
        env: "node",
      });

      setTimeout(() => {
        cfonts.say("GitHub : https://github.com/dev-sriji/", {
          font: "console",
          align: "left",
          colors: ["white"],
          background: "transparent",
          letterSpacing: 1,
          lineHeight: 1,
          space: true,
          maxLength: "0",
          gradient: ["red", "magenta"],
          independentGradient: false,
          transitionGradient: false,
          env: "node",
        });
      }, 2000);
    }, 3000);
  }, 5000);


  // sock.ev.on('contacts.update', async (data) => {
  sock.ws.on(`CB:notification`, async (node) => {
    console.log(node?.content[0])
    // async function saveProfilePictureOfUser(idUser) {
    //   try {
    //     const ppUrl = await sock.profilePictureUrl(idUser, 'image');
    //     const imageData = await downloadImage(ppUrl); // Corrected to await
    //     const base64Image = Buffer.from(imageData).toString('base64');
    //     await addDpsToUser(idUser, base64Image); // Corrected to await
    //   } catch (error) {
    //     console.error('Error handling user profile:', error);
    //     console.log("Error handling user profile... Contact Developer If it repeats".red.bold);
    //   }
    // }
  })


  function downloadImage(url) {
    return new Promise((resolve, reject) => {
      https.get(url, function (response) {
        let node = Buffer.alloc(0); // Initialize an empty buffer

        response.on('node', chunk => {
          node = Buffer.concat([node, chunk]); // Append each chunk to the buffer
        });

        response.on('end', () => {
          console.log('Image download complete');
          resolve(node); // Resolve the promise with the complete image node
        });
      }).on('error', error => {
        console.error('Error downloading image:', error);
        reject(error); // Reject the promise if there's an error
      });
    });
  }

  // async function addDpsToUser(id, imgData) {
  //   try {
  //     // console.log('Updating user with ID:', id);
  //     // console.log('Image node:', imgData);

  //     // Find the user by ID and update the 'dps' array
  //     const updatedUser = await Profile.findOneAndUpdate(
  //       { id: id },
  //       { $push: { dps: imgData } },
  //       { new: true }
  //     );

  //     if (!updatedUser) {
  //       console.error('User not found');
  //       return; // Handle the case where the user is not found
  //     }

  //     console.log('Dps added to user:', updatedUser);
  //   } catch (error) {
  //     console.error('Error adding dps to user:', error);
  //     console.log("Error adding dps to user... Contact Developer If it repeats".red.bold);
  //   }
  // }


}

connectToWhatsApp();